susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32F373.h
#define I2C2_SCL_PA9_ PA9,GPIO_AF4
#define I2C2_SCL_PF1_ PF1,GPIO_AF4
#define I2C2_SCL_PF6_ PF6,GPIO_AF4
#define _I2C2_SCL_PA9_ 1
#define _I2C2_SCL_PF1_ 1
#define _I2C2_SCL_PF6_ 1

#define I2C2_SDA_PA10_ PA10,GPIO_AF4
#define I2C2_SDA_PF0_ PF0,GPIO_AF4
#define I2C2_SDA_PF7_ PF7,GPIO_AF4
#define _I2C2_SDA_PA10_ 1
#define _I2C2_SDA_PF0_ 1
#define _I2C2_SDA_PF7_ 1

#define I2C2_SMBA_PA8_ PA8,GPIO_AF4
#define I2C2_SMBA_PF2_ PF2,GPIO_AF4
#define _I2C2_SMBA_PA8_ 1
#define _I2C2_SMBA_PF2_ 1

#define I2S1_CK_PA12_ PA12,GPIO_AF6
#define I2S1_CK_PA5_ PA5,GPIO_AF5
#define I2S1_CK_PB3_ PB3,GPIO_AF5
#define I2S1_CK_PC7_ PC7,GPIO_AF5
#define _I2S1_CK_PA12_ 1
#define _I2S1_CK_PA5_ 1
#define _I2S1_CK_PB3_ 1
#define _I2S1_CK_PC7_ 1

#define I2S1_MCK_PA13_ PA13,GPIO_AF6
#define I2S1_MCK_PA6_ PA6,GPIO_AF5
#define I2S1_MCK_PB4_ PB4,GPIO_AF5
#define I2S1_MCK_PC8_ PC8,GPIO_AF5
#define _I2S1_MCK_PA13_ 1
#define _I2S1_MCK_PA6_ 1
#define _I2S1_MCK_PB4_ 1
#define _I2S1_MCK_PC8_ 1

#define I2S1_SD_PA7_ PA7,GPIO_AF5
#define I2S1_SD_PB0_ PB0,GPIO_AF5
#define I2S1_SD_PB5_ PB5,GPIO_AF5
#define I2S1_SD_PC9_ PC9,GPIO_AF5
#define I2S1_SD_PF6_ PF6,GPIO_AF5
#define _I2S1_SD_PA7_ 1
#define _I2S1_SD_PB0_ 1
#define _I2S1_SD_PB5_ 1
#define _I2S1_SD_PC9_ 1
#define _I2S1_SD_PF6_ 1

#define I2S1_WS_PA11_ PA11,GPIO_AF6
#define I2S1_WS_PA15_ PA15,GPIO_AF5
#define I2S1_WS_PA4_ PA4,GPIO_AF5
#define I2S1_WS_PC6_ PC6,GPIO_AF5
#define _I2S1_WS_PA11_ 1
#define _I2S1_WS_PA15_ 1
#define _I2S1_WS_PA4_ 1
#define _I2S1_WS_PC6_ 1

#define I2S2_CK_PA8_ PA8,GPIO_AF5
#define I2S2_CK_PB10_ PB10,GPIO_AF5
#define I2S2_CK_PB8_ PB8,GPIO_AF5
#define I2S2_CK_PD7_ PD7,GPIO_AF5
#define I2S2_CK_PD8_ PD8,GPIO_AF5
#define _I2S2_CK_PA8_ 1
#define _I2S2_CK_PB10_ 1
#define _I2S2_CK_PB8_ 1
#define _I2S2_CK_PD7_ 1
#define _I2S2_CK_PD8_ 1

#define I2S2_MCK_PA9_ PA9,GPIO_AF5
#define I2S2_MCK_PB14_ PB14,GPIO_AF5
#define I2S2_MCK_PC2_ PC2,GPIO_AF5
#define I2S2_MCK_PD3_ PD3,GPIO_AF5
#define _I2S2_MCK_PA9_ 1
#define _I2S2_MCK_PB14_ 1
#define _I2S2_MCK_PC2_ 1
#define _I2S2_MCK_PD3_ 1

#define I2S2_SD_PA10_ PA10,GPIO_AF5
#define I2S2_SD_PB15_ PB15,GPIO_AF5
#define I2S2_SD_PC3_ PC3,GPIO_AF5
#define I2S2_SD_PD4_ PD4,GPIO_AF5
#define _I2S2_SD_PA10_ 1
#define _I2S2_SD_PB15_ 1
#define _I2S2_SD_PC3_ 1
#define _I2S2_SD_PD4_ 1

#define I2S2_WS_PA11_ PA11,GPIO_AF5
#define I2S2_WS_PB9_ PB9,GPIO_AF5
#define I2S2_WS_PD6_ PD6,GPIO_AF5
#define _I2S2_WS_PA11_ 1
#define _I2S2_WS_PB9_ 1
#define _I2S2_WS_PD6_ 1

#define I2S3_CK_PA1_ PA1,GPIO_AF6
#define I2S3_CK_PB3_ PB3,GPIO_AF6
#define I2S3_CK_PC10_ PC10,GPIO_AF6
#define _I2S3_CK_PA1_ 1
#define _I2S3_CK_PB3_ 1
#define _I2S3_CK_PC10_ 1

#define I2S3_MCK_PA2_ PA2,GPIO_AF6
#define I2S3_MCK_PB4_ PB4,GPIO_AF6
#define I2S3_MCK_PC11_ PC11,GPIO_AF6
#define _I2S3_MCK_PA2_ 1
#define _I2S3_MCK_PB4_ 1
#define _I2S3_MCK_PC11_ 1

#define I2S3_SD_PA3_ PA3,GPIO_AF6
#define I2S3_SD_PB5_ PB5,GPIO_AF6
#define I2S3_SD_PC12_ PC12,GPIO_AF6
#define _I2S3_SD_PA3_ 1
#define _I2S3_SD_PB5_ 1
#define _I2S3_SD_PC12_ 1

#define I2S3_WS_PA15_ PA15,GPIO_AF6
#define I2S3_WS_PA4_ PA4,GPIO_AF6
#define _I2S3_WS_PA15_ 1
#define _I2S3_WS_PA4_ 1

#define IR_OUT_PA13_ PA13,GPIO_AF5
#define IR_OUT_PB9_ PB9,GPIO_AF6
#define _IR_OUT_PA13_ 1
#define _IR_OUT_PB9_ 1

#define RCC_MCO_PA8_ PA8,GPIO_AF0
#define _RCC_MCO_PA8_ 1

#define RTC_REFIN_PA1_ PA1,GPIO_AF0
#define RTC_REFIN_PB15_ PB15,GPIO_AF0
#define _RTC_REFIN_PA1_ 1
#define _RTC_REFIN_PB15_ 1

#define SPI1_MISO_PA13_ PA13,GPIO_AF6
#define SPI1_MISO_PA6_ PA6,GPIO_AF5
#define SPI1_MISO_PB4_ PB4,GPIO_AF5
#define SPI1_MISO_PC8_ PC8,GPIO_AF5
#define _SPI1_MISO_PA13_ 1
#define _SPI1_MISO_PA6_ 1
#define _SPI1_MISO_PB4_ 1
#define _SPI1_MISO_PC8_ 1

#define SPI1_MOSI_PA7_ PA7,GPIO_AF5
#define SPI1_MOSI_PB0_ PB0,GPIO_AF5
#define SPI1_MOSI_PB5_ PB5,GPIO_AF5
#define SPI1_MOSI_PC9_ PC9,GPIO_AF5
#define SPI1_MOSI_PF6_ PF6,GPIO_AF5
#define _SPI1_MOSI_PA7_ 1
#define _SPI1_MOSI_PB0_ 1
#define _SPI1_MOSI_PB5_ 1
#define _SPI1_MOSI_PC9_ 1
#define _SPI1_MOSI_PF6_ 1

#define SPI1_NSS_PA11_ PA11,GPIO_AF6
#define SPI1_NSS_PA15_ PA15,GPIO_AF5
#define SPI1_NSS_PA4_ PA4,GPIO_AF5
#define SPI1_NSS_PC6_ PC6,GPIO_AF5
#define _SPI1_NSS_PA11_ 1
#define _SPI1_NSS_PA15_ 1
#define _SPI1_NSS_PA4_ 1
#define _SPI1_NSS_PC6_ 1

#define SPI1_SCK_PA12_ PA12,GPIO_AF6
#define SPI1_SCK_PA5_ PA5,GPIO_AF5
#define SPI1_SCK_PB3_ PB3,GPIO_AF5
#define SPI1_SCK_PC7_ PC7,GPIO_AF5
#define _SPI1_SCK_PA12_ 1
#define _SPI1_SCK_PA5_ 1
#define _SPI1_SCK_PB3_ 1
#define _SPI1_SCK_PC7_ 1

#define SPI2_MISO_PA9_ PA9,GPIO_AF5
#define SPI2_MISO_PB14_ PB14,GPIO_AF5
#define SPI2_MISO_PC2_ PC2,GPIO_AF5
#define SPI2_MISO_PD3_ PD3,GPIO_AF5
#define _SPI2_MISO_PA9_ 1
#define _SPI2_MISO_PB14_ 1
#define _SPI2_MISO_PC2_ 1
#define _SPI2_MISO_PD3_ 1

#define SPI2_MOSI_PA10_ PA10,GPIO_AF5
#define SPI2_MOSI_PB15_ PB15,GPIO_AF5
#define SPI2_MOSI_PC3_ PC3,GPIO_AF5
#define SPI2_MOSI_PD4_ PD4,GPIO_AF5
#define _SPI2_MOSI_PA10_ 1
#define _SPI2_MOSI_PB15_ 1
#define _SPI2_MOSI_PC3_ 1
#define _SPI2_MOSI_PD4_ 1

#define SPI2_NSS_PA11_ PA11,GPIO_AF5
#define SPI2_NSS_PB9_ PB9,GPIO_AF5
#define SPI2_NSS_PD6_ PD6,GPIO_AF5
#define _SPI2_NSS_PA11_ 1
#define _SPI2_NSS_PB9_ 1
#define _SPI2_NSS_PD6_ 1

#define SPI2_SCK_PA8_ PA8,GPIO_AF5
#define SPI2_SCK_PB10_ PB10,GPIO_AF5
#define SPI2_SCK_PB8_ PB8,GPIO_AF5
#define SPI2_SCK_PD7_ PD7,GPIO_AF5
#define SPI2_SCK_PD8_ PD8,GPIO_AF5
#define _SPI2_SCK_PA8_ 1
#define _SPI2_SCK_PB10_ 1
#define _SPI2_SCK_PB8_ 1
#define _SPI2_SCK_PD7_ 1
#define _SPI2_SCK_PD8_ 1

#define SPI3_MISO_PA2_ PA2,GPIO_AF6
#define SPI3_MISO_PB4_ PB4,GPIO_AF6
#define SPI3_MISO_PC11_ PC11,GPIO_AF6
#define _SPI3_MISO_PA2_ 1
#define _SPI3_MISO_PB4_ 1
#define _SPI3_MISO_PC11_ 1

#define SPI3_MOSI_PA3_ PA3,GPIO_AF6
#define SPI3_MOSI_PB5_ PB5,GPIO_AF6
#define SPI3_MOSI_PC12_ PC12,GPIO_AF6
#define _SPI3_MOSI_PA3_ 1
#define _SPI3_MOSI_PB5_ 1
#define _SPI3_MOSI_PC12_ 1

#define SPI3_NSS_PA15_ PA15,GPIO_AF6
#define SPI3_NSS_PA4_ PA4,GPIO_AF6
#define _SPI3_NSS_PA15_ 1
#define _SPI3_NSS_PA4_ 1

#define SPI3_SCK_PA1_ PA1,GPIO_AF6
#define SPI3_SCK_PB3_ PB3,GPIO_AF6
#define SPI3_SCK_PC10_ PC10,GPIO_AF6
#define _SPI3_SCK_PA1_ 1
#define _SPI3_SCK_PB3_ 1
#define _SPI3_SCK_PC10_ 1

#define SYS_JTCK-SWCLK_PA14_ PA14,GPIO_AF0
#define _SYS_JTCK-SWCLK_PA14_ 1

#define SYS_JTDI_PA15_ PA15,GPIO_AF0
#define _SYS_JTDI_PA15_ 1

#define SYS_JTDO-TRACESWO_PB3_ PB3,GPIO_AF0
#define _SYS_JTDO-TRACESWO_PB3_ 1

#define SYS_JTMS-SWDIO_PA13_ PA13,GPIO_AF0
#define _SYS_JTMS-SWDIO_PA13_ 1

#define SYS_NJTRST_PB4_ PB4,GPIO_AF0
#define _SYS_NJTRST_PB4_ 1

#define SYS_TRACECK_PE2_ PE2,GPIO_AF0
#define _SYS_TRACECK_PE2_ 1

#define SYS_TRACED0_PE3_ PE3,GPIO_AF0
#define _SYS_TRACED0_PE3_ 1

#define SYS_TRACED1_PE4_ PE4,GPIO_AF0
#define _SYS_TRACED1_PE4_ 1

#define SYS_TRACED2_PE5_ PE5,GPIO_AF0
#define _SYS_TRACED2_PE5_ 1

