susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32F373.h
#define SYS_TRACED3_PE6_ PE6,GPIO_AF0
#define _SYS_TRACED3_PE6_ 1

#define TIM12_CH1_PA14_ PA14,GPIO_AF10
#define TIM12_CH1_PA4_ PA4,GPIO_AF10
#define TIM12_CH1_PB14_ PB14,GPIO_AF9
#define _TIM12_CH1_PA14_ 1
#define _TIM12_CH1_PA4_ 1
#define _TIM12_CH1_PB14_ 1

#define TIM12_CH2_PA15_ PA15,GPIO_AF10
#define TIM12_CH2_PA5_ PA5,GPIO_AF10
#define TIM12_CH2_PB15_ PB15,GPIO_AF9
#define _TIM12_CH2_PA15_ 1
#define _TIM12_CH2_PA5_ 1
#define _TIM12_CH2_PB15_ 1

#define TIM13_CH1_PA6_ PA6,GPIO_AF9
#define TIM13_CH1_PA9_ PA9,GPIO_AF2
#define TIM13_CH1_PB3_ PB3,GPIO_AF9
#define TIM13_CH1_PC4_ PC4,GPIO_AF2
#define _TIM13_CH1_PA6_ 1
#define _TIM13_CH1_PA9_ 1
#define _TIM13_CH1_PB3_ 1
#define _TIM13_CH1_PC4_ 1

#define TIM14_CH1_PA10_ PA10,GPIO_AF9
#define TIM14_CH1_PA5_ PA5,GPIO_AF9
#define TIM14_CH1_PA7_ PA7,GPIO_AF9
#define TIM14_CH1_PF9_ PF9,GPIO_AF2
#define _TIM14_CH1_PA10_ 1
#define _TIM14_CH1_PA5_ 1
#define _TIM14_CH1_PA7_ 1
#define _TIM14_CH1_PF9_ 1

#define TIM15_BKIN_PA9_ PA9,GPIO_AF9
#define _TIM15_BKIN_PA9_ 1

#define TIM15_CH1_PA2_ PA2,GPIO_AF9
#define TIM15_CH1_PB14_ PB14,GPIO_AF1
#define TIM15_CH1_PB6_ PB6,GPIO_AF9
#define _TIM15_CH1_PA2_ 1
#define _TIM15_CH1_PB14_ 1
#define _TIM15_CH1_PB6_ 1

#define TIM15_CH1N_PA1_ PA1,GPIO_AF9
#define TIM15_CH1N_PB15_ PB15,GPIO_AF2
#define TIM15_CH1N_PB4_ PB4,GPIO_AF9
#define _TIM15_CH1N_PA1_ 1
#define _TIM15_CH1N_PB15_ 1
#define _TIM15_CH1N_PB4_ 1

#define TIM15_CH2_PA3_ PA3,GPIO_AF9
#define TIM15_CH2_PB15_ PB15,GPIO_AF1
#define TIM15_CH2_PB7_ PB7,GPIO_AF9
#define _TIM15_CH2_PA3_ 1
#define _TIM15_CH2_PB15_ 1
#define _TIM15_CH2_PB7_ 1

#define TIM16_BKIN_PB5_ PB5,GPIO_AF1
#define _TIM16_BKIN_PB5_ 1

#define TIM16_CH1_PA12_ PA12,GPIO_AF1
#define TIM16_CH1_PA6_ PA6,GPIO_AF1
#define TIM16_CH1_PB4_ PB4,GPIO_AF1
#define TIM16_CH1_PB8_ PB8,GPIO_AF1
#define _TIM16_CH1_PA12_ 1
#define _TIM16_CH1_PA6_ 1
#define _TIM16_CH1_PB4_ 1
#define _TIM16_CH1_PB8_ 1

#define TIM16_CH1N_PA13_ PA13,GPIO_AF1
#define TIM16_CH1N_PB6_ PB6,GPIO_AF1
#define _TIM16_CH1N_PA13_ 1
#define _TIM16_CH1N_PB6_ 1

#define TIM17_BKIN_PA10_ PA10,GPIO_AF1
#define TIM17_BKIN_PB4_ PB4,GPIO_AF10
#define _TIM17_BKIN_PA10_ 1
#define _TIM17_BKIN_PB4_ 1

#define TIM17_CH1_PA7_ PA7,GPIO_AF1
#define TIM17_CH1_PB5_ PB5,GPIO_AF10
#define TIM17_CH1_PB9_ PB9,GPIO_AF1
#define _TIM17_CH1_PA7_ 1
#define _TIM17_CH1_PB5_ 1
#define _TIM17_CH1_PB9_ 1

#define TIM17_CH1N_PB7_ PB7,GPIO_AF1
#define _TIM17_CH1N_PB7_ 1

#define TIM19_CH1_PA0_ PA0,GPIO_AF11
#define TIM19_CH1_PB6_ PB6,GPIO_AF11
#define TIM19_CH1_PC10_ PC10,GPIO_AF2
#define _TIM19_CH1_PA0_ 1
#define _TIM19_CH1_PB6_ 1
#define _TIM19_CH1_PC10_ 1

#define TIM19_CH2_PA1_ PA1,GPIO_AF11
#define TIM19_CH2_PB7_ PB7,GPIO_AF11
#define TIM19_CH2_PC11_ PC11,GPIO_AF2
#define _TIM19_CH2_PA1_ 1
#define _TIM19_CH2_PB7_ 1
#define _TIM19_CH2_PC11_ 1

#define TIM19_CH3_PA2_ PA2,GPIO_AF11
#define TIM19_CH3_PB8_ PB8,GPIO_AF11
#define TIM19_CH3_PC12_ PC12,GPIO_AF2
#define _TIM19_CH3_PA2_ 1
#define _TIM19_CH3_PB8_ 1
#define _TIM19_CH3_PC12_ 1

#define TIM19_CH4_PA3_ PA3,GPIO_AF11
#define TIM19_CH4_PB9_ PB9,GPIO_AF11
#define TIM19_CH4_PD0_ PD0,GPIO_AF2
#define _TIM19_CH4_PA3_ 1
#define _TIM19_CH4_PB9_ 1
#define _TIM19_CH4_PD0_ 1

#define TIM19_ETR_PB5_ PB5,GPIO_AF11
#define TIM19_ETR_PD1_ PD1,GPIO_AF2
#define _TIM19_ETR_PB5_ 1
#define _TIM19_ETR_PD1_ 1

#define TIM2_CH1_PA0_ PA0,GPIO_AF1
#define TIM2_CH1_PA15_ PA15,GPIO_AF1
#define TIM2_CH1_PA5_ PA5,GPIO_AF1
#define _TIM2_CH1_PA0_ 1
#define _TIM2_CH1_PA15_ 1
#define _TIM2_CH1_PA5_ 1

#define TIM2_CH2_PA1_ PA1,GPIO_AF1
#define TIM2_CH2_PB3_ PB3,GPIO_AF1
#define _TIM2_CH2_PA1_ 1
#define _TIM2_CH2_PB3_ 1

#define TIM2_CH3_PA2_ PA2,GPIO_AF1
#define TIM2_CH3_PA9_ PA9,GPIO_AF10
#define TIM2_CH3_PB10_ PB10,GPIO_AF1
#define _TIM2_CH3_PA2_ 1
#define _TIM2_CH3_PA9_ 1
#define _TIM2_CH3_PB10_ 1

#define TIM2_CH4_PA10_ PA10,GPIO_AF10
#define TIM2_CH4_PA3_ PA3,GPIO_AF1
#define _TIM2_CH4_PA10_ 1
#define _TIM2_CH4_PA3_ 1

#define TIM2_ETR_PA0_ PA0,GPIO_AF1
#define TIM2_ETR_PA15_ PA15,GPIO_AF1
#define TIM2_ETR_PA5_ PA5,GPIO_AF1
#define _TIM2_ETR_PA0_ 1
#define _TIM2_ETR_PA15_ 1
#define _TIM2_ETR_PA5_ 1

#define TIM3_CH1_PA6_ PA6,GPIO_AF2
#define TIM3_CH1_PB4_ PB4,GPIO_AF2
#define TIM3_CH1_PC6_ PC6,GPIO_AF2
#define _TIM3_CH1_PA6_ 1
#define _TIM3_CH1_PB4_ 1
#define _TIM3_CH1_PC6_ 1

#define TIM3_CH2_PA4_ PA4,GPIO_AF2
#define TIM3_CH2_PA7_ PA7,GPIO_AF2
#define TIM3_CH2_PB0_ PB0,GPIO_AF10
#define TIM3_CH2_PB5_ PB5,GPIO_AF2
#define TIM3_CH2_PC7_ PC7,GPIO_AF2
#define _TIM3_CH2_PA4_ 1
#define _TIM3_CH2_PA7_ 1
#define _TIM3_CH2_PB0_ 1
#define _TIM3_CH2_PB5_ 1
#define _TIM3_CH2_PC7_ 1

#define TIM3_CH3_PB0_ PB0,GPIO_AF2
#define TIM3_CH3_PB6_ PB6,GPIO_AF10
#define TIM3_CH3_PC8_ PC8,GPIO_AF2
#define _TIM3_CH3_PB0_ 1
#define _TIM3_CH3_PB6_ 1
#define _TIM3_CH3_PC8_ 1

#define TIM3_CH4_PB1_ PB1,GPIO_AF2
#define TIM3_CH4_PB7_ PB7,GPIO_AF10
#define TIM3_CH4_PC9_ PC9,GPIO_AF2
#define _TIM3_CH4_PB1_ 1
#define _TIM3_CH4_PB7_ 1
#define _TIM3_CH4_PC9_ 1

#define TIM3_ETR_PB3_ PB3,GPIO_AF10
#define TIM3_ETR_PD2_ PD2,GPIO_AF2
#define _TIM3_ETR_PB3_ 1
#define _TIM3_ETR_PD2_ 1

#define TIM4_CH1_PA11_ PA11,GPIO_AF10
#define TIM4_CH1_PB6_ PB6,GPIO_AF2
#define TIM4_CH1_PD12_ PD12,GPIO_AF2
#define _TIM4_CH1_PA11_ 1
#define _TIM4_CH1_PB6_ 1
#define _TIM4_CH1_PD12_ 1

#define TIM4_CH2_PA12_ PA12,GPIO_AF10
#define TIM4_CH2_PB7_ PB7,GPIO_AF2
#define TIM4_CH2_PD13_ PD13,GPIO_AF2
#define _TIM4_CH2_PA12_ 1
#define _TIM4_CH2_PB7_ 1
#define _TIM4_CH2_PD13_ 1

#define TIM4_CH3_PA13_ PA13,GPIO_AF10
#define TIM4_CH3_PB8_ PB8,GPIO_AF2
#define TIM4_CH3_PD14_ PD14,GPIO_AF2
#define _TIM4_CH3_PA13_ 1
#define _TIM4_CH3_PB8_ 1
#define _TIM4_CH3_PD14_ 1

#define TIM4_CH4_PB9_ PB9,GPIO_AF2
#define TIM4_CH4_PD15_ PD15,GPIO_AF2
#define TIM4_CH4_PF6_ PF6,GPIO_AF2
#define _TIM4_CH4_PB9_ 1
#define _TIM4_CH4_PD15_ 1
#define _TIM4_CH4_PF6_ 1

#define TIM4_ETR_PA8_ PA8,GPIO_AF10
#define TIM4_ETR_PB3_ PB3,GPIO_AF2
#define TIM4_ETR_PE0_ PE0,GPIO_AF2
#define _TIM4_ETR_PA8_ 1
#define _TIM4_ETR_PB3_ 1
#define _TIM4_ETR_PE0_ 1

#define TIM5_CH1_PA0_ PA0,GPIO_AF2
#define TIM5_CH1_PA8_ PA8,GPIO_AF2
#define TIM5_CH1_PC0_ PC0,GPIO_AF2
#define _TIM5_CH1_PA0_ 1
#define _TIM5_CH1_PA8_ 1
#define _TIM5_CH1_PC0_ 1

