susanw1/zscript/receivers/native/arm/implementations/no-os-stm32/src/main/c++/stm32/AlternateFunction/STM32F373.h
#define TIM5_CH2_PA1_ PA1,GPIO_AF2
#define TIM5_CH2_PA11_ PA11,GPIO_AF2
#define TIM5_CH2_PC1_ PC1,GPIO_AF2
#define _TIM5_CH2_PA1_ 1
#define _TIM5_CH2_PA11_ 1
#define _TIM5_CH2_PC1_ 1

#define TIM5_CH3_PA12_ PA12,GPIO_AF2
#define TIM5_CH3_PA2_ PA2,GPIO_AF2
#define TIM5_CH3_PC2_ PC2,GPIO_AF2
#define _TIM5_CH3_PA12_ 1
#define _TIM5_CH3_PA2_ 1
#define _TIM5_CH3_PC2_ 1

#define TIM5_CH4_PA13_ PA13,GPIO_AF2
#define TIM5_CH4_PA3_ PA3,GPIO_AF2
#define TIM5_CH4_PC3_ PC3,GPIO_AF2
#define _TIM5_CH4_PA13_ 1
#define _TIM5_CH4_PA3_ 1
#define _TIM5_CH4_PC3_ 1

#define TIM5_ETR_PA0_ PA0,GPIO_AF2
#define TIM5_ETR_PA8_ PA8,GPIO_AF2
#define TIM5_ETR_PC0_ PC0,GPIO_AF2
#define _TIM5_ETR_PA0_ 1
#define _TIM5_ETR_PA8_ 1
#define _TIM5_ETR_PC0_ 1

#define TSC_G1_IO1_PA0_ PA0,GPIO_AF3
#define _TSC_G1_IO1_PA0_ 1

#define TSC_G1_IO2_PA1_ PA1,GPIO_AF3
#define _TSC_G1_IO2_PA1_ 1

#define TSC_G1_IO3_PA2_ PA2,GPIO_AF3
#define _TSC_G1_IO3_PA2_ 1

#define TSC_G1_IO4_PA3_ PA3,GPIO_AF3
#define _TSC_G1_IO4_PA3_ 1

#define TSC_G2_IO1_PA4_ PA4,GPIO_AF3
#define _TSC_G2_IO1_PA4_ 1

#define TSC_G2_IO2_PA5_ PA5,GPIO_AF3
#define _TSC_G2_IO2_PA5_ 1

#define TSC_G2_IO3_PA6_ PA6,GPIO_AF3
#define _TSC_G2_IO3_PA6_ 1

#define TSC_G2_IO4_PA7_ PA7,GPIO_AF3
#define _TSC_G2_IO4_PA7_ 1

#define TSC_G3_IO1_PC4_ PC4,GPIO_AF3
#define _TSC_G3_IO1_PC4_ 1

#define TSC_G3_IO2_PC5_ PC5,GPIO_AF3
#define _TSC_G3_IO2_PC5_ 1

#define TSC_G3_IO3_PB0_ PB0,GPIO_AF3
#define _TSC_G3_IO3_PB0_ 1

#define TSC_G3_IO4_PB1_ PB1,GPIO_AF3
#define _TSC_G3_IO4_PB1_ 1

#define TSC_G4_IO1_PA9_ PA9,GPIO_AF3
#define _TSC_G4_IO1_PA9_ 1

#define TSC_G4_IO2_PA10_ PA10,GPIO_AF3
#define _TSC_G4_IO2_PA10_ 1

#define TSC_G4_IO3_PA13_ PA13,GPIO_AF3
#define _TSC_G4_IO3_PA13_ 1

#define TSC_G4_IO4_PA14_ PA14,GPIO_AF3
#define _TSC_G4_IO4_PA14_ 1

#define TSC_G5_IO1_PB3_ PB3,GPIO_AF3
#define _TSC_G5_IO1_PB3_ 1

#define TSC_G5_IO2_PB4_ PB4,GPIO_AF3
#define _TSC_G5_IO2_PB4_ 1

#define TSC_G5_IO3_PB6_ PB6,GPIO_AF3
#define _TSC_G5_IO3_PB6_ 1

#define TSC_G5_IO4_PB7_ PB7,GPIO_AF3
#define _TSC_G5_IO4_PB7_ 1

#define TSC_G6_IO1_PB14_ PB14,GPIO_AF3
#define _TSC_G6_IO1_PB14_ 1

#define TSC_G6_IO2_PB15_ PB15,GPIO_AF3
#define _TSC_G6_IO2_PB15_ 1

#define TSC_G6_IO3_PD8_ PD8,GPIO_AF3
#define _TSC_G6_IO3_PD8_ 1

#define TSC_G6_IO4_PD9_ PD9,GPIO_AF3
#define _TSC_G6_IO4_PD9_ 1

#define TSC_G7_IO1_PE2_ PE2,GPIO_AF3
#define _TSC_G7_IO1_PE2_ 1

#define TSC_G7_IO2_PE3_ PE3,GPIO_AF3
#define _TSC_G7_IO2_PE3_ 1

#define TSC_G7_IO3_PE4_ PE4,GPIO_AF3
#define _TSC_G7_IO3_PE4_ 1

#define TSC_G7_IO4_PE5_ PE5,GPIO_AF3
#define _TSC_G7_IO4_PE5_ 1

#define TSC_G8_IO1_PD12_ PD12,GPIO_AF3
#define _TSC_G8_IO1_PD12_ 1

#define TSC_G8_IO2_PD13_ PD13,GPIO_AF3
#define _TSC_G8_IO2_PD13_ 1

#define TSC_G8_IO3_PD14_ PD14,GPIO_AF3
#define _TSC_G8_IO3_PD14_ 1

#define TSC_G8_IO4_PD15_ PD15,GPIO_AF3
#define _TSC_G8_IO4_PD15_ 1

#define TSC_SYNC_PA15_ PA15,GPIO_AF3
#define TSC_SYNC_PB10_ PB10,GPIO_AF3
#define TSC_SYNC_PB8_ PB8,GPIO_AF3
#define _TSC_SYNC_PA15_ 1
#define _TSC_SYNC_PB10_ 1
#define _TSC_SYNC_PB8_ 1

#define UART1_CK_PA8_ PA8,GPIO_AF7
#define _UART1_CK_PA8_ 1

#define UART1_CTS_PA11_ PA11,GPIO_AF7
#define _UART1_CTS_PA11_ 1

#define UART1_DE_PA12_ PA12,GPIO_AF7
#define _UART1_DE_PA12_ 1

#define UART1_RTS_PA12_ PA12,GPIO_AF7
#define _UART1_RTS_PA12_ 1

#define UART1_RX_PA10_ PA10,GPIO_AF7
#define UART1_RX_PB7_ PB7,GPIO_AF7
#define UART1_RX_PC5_ PC5,GPIO_AF7
#define UART1_RX_PE1_ PE1,GPIO_AF7
#define _UART1_RX_PA10_ 1
#define _UART1_RX_PB7_ 1
#define _UART1_RX_PC5_ 1
#define _UART1_RX_PE1_ 1

#define UART1_TX_PA9_ PA9,GPIO_AF7
#define UART1_TX_PB6_ PB6,GPIO_AF7
#define UART1_TX_PC4_ PC4,GPIO_AF7
#define UART1_TX_PE0_ PE0,GPIO_AF7
#define _UART1_TX_PA9_ 1
#define _UART1_TX_PB6_ 1
#define _UART1_TX_PC4_ 1
#define _UART1_TX_PE0_ 1

#define UART2_CK_PA4_ PA4,GPIO_AF7
#define UART2_CK_PB5_ PB5,GPIO_AF7
#define UART2_CK_PD7_ PD7,GPIO_AF7
#define UART2_CK_PF7_ PF7,GPIO_AF7
#define _UART2_CK_PA4_ 1
#define _UART2_CK_PB5_ 1
#define _UART2_CK_PD7_ 1
#define _UART2_CK_PF7_ 1

#define UART2_CTS_PA0_ PA0,GPIO_AF7
#define UART2_CTS_PD3_ PD3,GPIO_AF7
#define _UART2_CTS_PA0_ 1
#define _UART2_CTS_PD3_ 1

#define UART2_DE_PA1_ PA1,GPIO_AF7
#define UART2_DE_PD4_ PD4,GPIO_AF7
#define _UART2_DE_PA1_ 1
#define _UART2_DE_PD4_ 1

#define UART2_RTS_PA1_ PA1,GPIO_AF7
#define UART2_RTS_PD4_ PD4,GPIO_AF7
#define _UART2_RTS_PA1_ 1
#define _UART2_RTS_PD4_ 1

#define UART2_RX_PA3_ PA3,GPIO_AF7
#define UART2_RX_PB4_ PB4,GPIO_AF7
#define UART2_RX_PD6_ PD6,GPIO_AF7
#define _UART2_RX_PA3_ 1
#define _UART2_RX_PB4_ 1
#define _UART2_RX_PD6_ 1

#define UART2_TX_PA2_ PA2,GPIO_AF7
#define UART2_TX_PB3_ PB3,GPIO_AF7
#define UART2_TX_PD5_ PD5,GPIO_AF7
#define _UART2_TX_PA2_ 1
#define _UART2_TX_PB3_ 1
#define _UART2_TX_PD5_ 1

#define UART3_CK_PC12_ PC12,GPIO_AF7
#define UART3_CK_PD10_ PD10,GPIO_AF7
#define _UART3_CK_PC12_ 1
#define _UART3_CK_PD10_ 1

#define UART3_CTS_PA13_ PA13,GPIO_AF7
#define UART3_CTS_PD11_ PD11,GPIO_AF7
#define _UART3_CTS_PA13_ 1
#define _UART3_CTS_PD11_ 1

#define UART3_DE_PB14_ PB14,GPIO_AF7
#define UART3_DE_PD12_ PD12,GPIO_AF7
#define UART3_DE_PF6_ PF6,GPIO_AF7
#define _UART3_DE_PB14_ 1
#define _UART3_DE_PD12_ 1
#define _UART3_DE_PF6_ 1

#define UART3_RTS_PB14_ PB14,GPIO_AF7
#define UART3_RTS_PD12_ PD12,GPIO_AF7
#define UART3_RTS_PF6_ PF6,GPIO_AF7
#define _UART3_RTS_PB14_ 1
#define _UART3_RTS_PD12_ 1
#define _UART3_RTS_PF6_ 1

#define UART3_RX_PB9_ PB9,GPIO_AF7
#define UART3_RX_PC11_ PC11,GPIO_AF7
#define UART3_RX_PD9_ PD9,GPIO_AF7
#define UART3_RX_PE15_ PE15,GPIO_AF7
#define _UART3_RX_PB9_ 1
#define _UART3_RX_PC11_ 1
#define _UART3_RX_PD9_ 1
#define _UART3_RX_PE15_ 1

#define UART3_TX_PB10_ PB10,GPIO_AF7
#define UART3_TX_PB8_ PB8,GPIO_AF7
#define UART3_TX_PC10_ PC10,GPIO_AF7
#define UART3_TX_PD8_ PD8,GPIO_AF7
#define _UART3_TX_PB10_ 1
#define _UART3_TX_PB8_ 1
#define _UART3_TX_PC10_ 1
#define _UART3_TX_PD8_ 1

#define USART1_CK_PA8_ PA8,GPIO_AF7
#define _USART1_CK_PA8_ 1

#define USART1_CTS_PA11_ PA11,GPIO_AF7
#define _USART1_CTS_PA11_ 1

#define USART1_DE_PA12_ PA12,GPIO_AF7
#define _USART1_DE_PA12_ 1

#define USART1_RTS_PA12_ PA12,GPIO_AF7
#define _USART1_RTS_PA12_ 1

#define USART1_RX_PA10_ PA10,GPIO_AF7
#define USART1_RX_PB7_ PB7,GPIO_AF7
#define USART1_RX_PC5_ PC5,GPIO_AF7
#define USART1_RX_PE1_ PE1,GPIO_AF7
#define _USART1_RX_PA10_ 1
#define _USART1_RX_PB7_ 1
#define _USART1_RX_PC5_ 1
#define _USART1_RX_PE1_ 1

